Tekla.Structures.Plugins.PropertyPane.WeldEnum
The weld enum property type.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.None
The None.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.Around
The edge/around.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.Type
The weld type.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.Contour
The contour none/flush/contour/concave.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.Finish
The finish.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.IntermittentType
The intermittent type.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.NdtInspectionType
The ndt inspection.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.PlacementType
The placement auto/main/secondary.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.Position
The position.

Tekla.Structures.Plugins.PropertyPane.WeldEnum.PreparationType
The preparation plusx/minusx...

Tekla.Structures.Plugins.PropertyPane.WeldEnum.ProcessType
The process smaw/saw...

Tekla.Structures.Plugins.PropertyPane.WeldEnum.WorkshopSite
The workshop/site.